<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>PHP_HW2</title>
</head>
<body>
    <?php 
    
/*1. Если переменная $a пустая, то выведите 'Верно', иначе выведите 'Неверно'.Проверьте работу скрипта при $a, равном 1, 3, -3, 0, null, true, '', '0'.*/
echo "<hr>";
echo "<p><b>Task 1</b></p>";

echo "<hr>";

/*2. Дано трехзначное число. Поменяйте среднюю цифру на ноль. */
echo "<p><b>Task 2</b></p>";

echo "<hr>";

/*3. Если переменная $a равна или меньше 1, а переменная $b больше или 
равна 3, то выведите сумму этих переменных, иначе выведите их разность 
(результат вычитания). Проверьте работу скрипта при $a и $b, равном 1 и 3, 0и 6, 3 и 5.*/
echo "<p><b>Task 3</b></p>";

echo "<hr>";

/*4. Дана строка с символами, например, 'abcde'. Проверьте, что первым 
символом этой строки является буква 'a'. Если это так - выведите 'да', в противном случае выведите 'нет'.*/
echo "<p><b>Task 4</b></p>";

echo "<hr>";

/*5. Дана строка из 6-ти цифр. Проверьте, что сумма первых трех цифр 
равняется сумме вторых трех цифр. Если это так - выведите 'да', в противном случае выведите 'нет'.*/
echo "<p><b>Task 5</b></p>";

echo "<hr>";

/*6. Разработайте программу, которая определяла количество прошедших 
часов по введенным пользователем градусах. Введенное число может быть от
0 до 360.*/
echo "<p><b>Task 6</b></p>";

echo "<hr>";

/*7. Разработайте программу, которая из чисел 20 .. 45 находила те, которые делятся на 5 и найдите сумму этих чисел.*/
echo "<p><b>Task 7</b></p>";

echo "<hr>";

/*8. Дано пятизначное число. Цифры на четных позициях «занулить». 
Например, из 12345 получается число 10305. */
echo "<p><b>Task 8</b></p>";

echo "<hr>";

/*9. Дано число $num=1000. Делите его на 2 столько раз, пока результат 
деления не станет меньше 50. Какое число получится? Посчитайте 
количество итераций, необходимых для этого (итерация - это проход цикла). Решите задачу сначала через цикл while, а потом через цикл for.*/
echo "<p><b>Task 9</b></p>";

echo "<hr>";

/*10. Вывести на экран фигуру из звездочек:
*******
*******
*******
*******
(квадрат из n строк, в каждой строке n звездочек)*/

echo "<p><b>Task 10</b></p>";

echo "<hr>";   
    ?>

</body>
</html>